{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA0_i",
   "name" : "int [0]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA0_i",
   "source_file" : "system/core/libcutils/include_outside_system/cutils/native_handle.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA5121_h",
   "name" : "unsigned char [5121]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA5121_h",
   "size" : 5121,
   "source_file" : "system/logging/liblog/include_vndk/log/log_read.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA8_j",
   "name" : "unsigned int [8]",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIA8_j",
   "size" : 32,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "linker_set_key" : "_ZTIA_f",
   "name" : "float []",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIA_f",
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 2,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIDs",
   "name" : "char16_t",
   "referenced_type" : "_ZTIDs",
   "self_type" : "_ZTIDs",
   "size" : 2
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "_ZTIa",
   "name" : "signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIa",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",

   "is_const" : true,
   "linker_set_key" : "_ZTIKPN7android7RefBase12weakref_implE",
   "name" : "android::RefBase::weakref_impl *const",
   "referenced_type" : "_ZTIPN7android7RefBase12weakref_implE",
   "self_type" : "_ZTIKPN7android7RefBase12weakref_implE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPN7android7RefBase12weakref_typeE",
   "name" : "android::RefBase::weakref_type *const",
   "referenced_type" : "_ZTIPN7android7RefBase12weakref_typeE",
   "self_type" : "_ZTIKPN7android7RefBase12weakref_typeE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPN7android7RefBaseE",
   "name" : "android::RefBase *const",
   "referenced_type" : "_ZTIPN7android7RefBaseE",
   "self_type" : "_ZTIKPN7android7RefBaseE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPN7android8hardware7IBinderE",
   "name" : "android::hardware::IBinder *const",
   "referenced_type" : "_ZTIPN7android8hardware7IBinderE",
   "self_type" : "_ZTIKPN7android8hardware7IBinderE",
   "size" : 8,
   "source_file" : "system/libhwbinder/include/hwbinder/Binder.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPN7android8hardware9BHwBinderE",
   "name" : "android::hardware::BHwBinder *const",
   "referenced_type" : "_ZTIPN7android8hardware9BHwBinderE",
   "self_type" : "_ZTIKPN7android8hardware9BHwBinderE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKa",
   "name" : "const signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIKa",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/String8.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKd",
   "name" : "const double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIKd",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIKl",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKm",
   "name" : "const unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIKm",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKs",
   "name" : "const short",
   "referenced_type" : "_ZTIs",
   "self_type" : "_ZTIKs",
   "size" : 2,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKt",
   "name" : "const unsigned short",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIKt",
   "size" : 2,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "system/libhwbinder/include/hwbinder/IBinder.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKy",
   "name" : "const unsigned long long",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIKy",
   "size" : 8,
   "source_file" : "system/libhwbinder/include/hwbinder/Parcel.h"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVb",
   "name" : "volatile bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIVb",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/Thread.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVi",
   "name" : "volatile int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIVi",
   "size" : 4,
   "source_file" : "system/libhwbinder/include/hwbinder/BpHwBinder.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "uid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12logger_entry",
   "name" : "logger_entry",
   "referenced_type" : "_ZTI12logger_entry",
   "self_type" : "_ZTI12logger_entry",
   "size" : 28,
   "source_file" : "system/logging/liblog/include_vndk/log/log_read.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "y",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "cb",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "cr",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "ystride",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "cstride",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "chroma_step",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 384,
     "referenced_type" : "_ZTIA8_j"
    }
   ],
   "linker_set_key" : "_ZTI13android_ycbcr",
   "name" : "android_ycbcr",
   "referenced_type" : "_ZTI13android_ycbcr",
   "self_type" : "_ZTI13android_ycbcr",
   "size" : 80,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numFds",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numInts",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA0_i"
    }
   ],
   "linker_set_key" : "_ZTI13native_handle",
   "name" : "native_handle",
   "referenced_type" : "_ZTI13native_handle",
   "self_type" : "_ZTI13native_handle",
   "size" : 12,
   "source_file" : "system/core/libcutils/include_outside_system/cutils/native_handle.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI16android_xy_color",
   "name" : "android_xy_color",
   "referenced_type" : "_ZTI16android_xy_color",
   "self_type" : "_ZTI16android_xy_color",
   "size" : 8,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "top_left",
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "component",
     "field_offset" : 64,
     "referenced_type" : "_ZTI22android_flex_component"
    },
    {
     "field_name" : "bits_per_component",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bits_used",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "h_increment",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "v_increment",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "h_subsampling",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "v_subsampling",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI18android_flex_plane",
   "name" : "android_flex_plane",
   "referenced_type" : "_ZTI18android_flex_plane",
   "self_type" : "_ZTI18android_flex_plane",
   "size" : 40,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "format",
     "referenced_type" : "_ZTI19android_flex_format"
    },
    {
     "field_name" : "num_planes",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "planes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP18android_flex_plane"
    }
   ],
   "linker_set_key" : "_ZTI19android_flex_layout",
   "name" : "android_flex_layout",
   "referenced_type" : "_ZTI19android_flex_layout",
   "self_type" : "_ZTI19android_flex_layout",
   "size" : 16,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_points",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA8_j"
    },
    {
     "field_name" : "xyzc_points",
     "field_offset" : 288,
     "referenced_type" : "_ZTIA_f"
    }
   ],
   "linker_set_key" : "_ZTI20android_depth_points",
   "name" : "android_depth_points",
   "referenced_type" : "_ZTI20android_depth_points",
   "self_type" : "_ZTI20android_depth_points",
   "size" : 36,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "struct_size",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "buffer_id",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "priority",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tag",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "file",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "line",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "message",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI21__android_log_message",
   "name" : "__android_log_message",
   "referenced_type" : "_ZTI21__android_log_message",
   "self_type" : "_ZTI21__android_log_message",
   "size" : 48,
   "source_file" : "system/logging/liblog/include_vndk/android/log.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "maxContentLightLevel",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "maxFrameAverageLightLevel",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI25android_cta861_3_metadata",
   "name" : "android_cta861_3_metadata",
   "referenced_type" : "_ZTI25android_cta861_3_metadata",
   "self_type" : "_ZTI25android_cta861_3_metadata",
   "size" : 8,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "displayPrimaryRed",
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "displayPrimaryGreen",
     "field_offset" : 64,
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "displayPrimaryBlue",
     "field_offset" : 128,
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "whitePoint",
     "field_offset" : 192,
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "maxLuminance",
     "field_offset" : 256,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "minLuminance",
     "field_offset" : 288,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI26android_smpte2086_metadata",
   "name" : "android_smpte2086_metadata",
   "referenced_type" : "_ZTI26android_smpte2086_metadata",
   "self_type" : "_ZTI26android_smpte2086_metadata",
   "size" : 40,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7log_msgUt_E"
    }
   ],
   "linker_set_key" : "_ZTI7log_msg",
   "name" : "log_msg",
   "referenced_type" : "_ZTI7log_msg",
   "self_type" : "_ZTI7log_msg",
   "size" : 5124,
   "source_file" : "system/logging/liblog/include_vndk/log/log_read.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI8log_time",
   "name" : "log_time",
   "referenced_type" : "_ZTI8log_time",
   "self_type" : "_ZTI8log_time",
   "size" : 8,
   "source_file" : "system/logging/liblog/include_vndk/log/log_time.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStorage",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "mCount",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIKj"
    },
    {
     "access" : "private",
     "field_name" : "mItemSize",
     "field_offset" : 256,
     "referenced_type" : "_ZTIKm"
    }
   ],
   "linker_set_key" : "_ZTIN7android10VectorImplE",
   "name" : "android::VectorImpl",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10VectorImplE",
   "self_type" : "_ZTIN7android10VectorImplE",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/VectorImpl.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10VectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvm"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11KeyedVectorIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEE",
   "name" : "android::KeyedVector<const void *, android::hardware::BpHwBinder::ObjectManager::entry_t>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11KeyedVectorIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEE",
   "self_type" : "_ZTIN7android11KeyedVectorIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEE",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/KeyedVector.h",
   "template_args" :
   [
    "_ZTIPKv",
    "_ZTIN7android8hardware10BpHwBinder13ObjectManager7entry_tE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "_ZTINSt3__16atomicIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "name" : "android::LightRefBase<android::VirtualLightRefBase>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "self_type" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "_ZTIN7android19VirtualLightRefBaseE" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android16SortedVectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEEE",
   "name" : "android::SortedVector<android::key_value_pair_t<const void *, android::hardware::BpHwBinder::ObjectManager::entry_t>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEEE",
   "self_type" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEEE",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/SortedVector.h",
   "template_args" :
   [
    "_ZTIN7android16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEE7do_copyEPvS3_m"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEE8do_splatEPvS3_m"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEE15do_move_forwardEPvS3_m"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEE16do_move_backwardEPvS3_m"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEE10do_compareES3_S3_"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEEE",
   "name" : "android::trait_pointer<android::key_value_pair_t<const void *, android::hardware::BpHwBinder::ObjectManager::entry_t>>",
   "referenced_type" : "_ZTIN7android13trait_pointerINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEEE",
   "self_type" : "_ZTIN7android13trait_pointerINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIN7android16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEEE",
   "name" : "android::trait_pointer<android::sp<android::hardware::BufferedTextOutput::BufferState>>",
   "referenced_type" : "_ZTIN7android13trait_pointerINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEEE",
   "self_type" : "_ZTIN7android13trait_pointerINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android2spINS_8hardware18BufferedTextOutput11BufferStateEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerINS_8hardware10BpHwBinder13ObjectManager7entry_tEEE",
   "name" : "android::trait_pointer<android::hardware::BpHwBinder::ObjectManager::entry_t>",
   "referenced_type" : "_ZTIN7android13trait_pointerINS_8hardware10BpHwBinder13ObjectManager7entry_tEEE",
   "self_type" : "_ZTIN7android13trait_pointerINS_8hardware10BpHwBinder13ObjectManager7entry_tEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android8hardware10BpHwBinder13ObjectManager7entry_tE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerINS_8hardware10BpHwBinder8ObituaryEEE",
   "name" : "android::trait_pointer<android::hardware::BpHwBinder::Obituary>",
   "referenced_type" : "_ZTIN7android13trait_pointerINS_8hardware10BpHwBinder8ObituaryEEE",
   "self_type" : "_ZTIN7android13trait_pointerINS_8hardware10BpHwBinder8ObituaryEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android8hardware10BpHwBinder8ObituaryE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerINS_8hardware12ProcessState12handle_entryEEE",
   "name" : "android::trait_pointer<android::hardware::ProcessState::handle_entry>",
   "referenced_type" : "_ZTIN7android13trait_pointerINS_8hardware12ProcessState12handle_entryEEE",
   "self_type" : "_ZTIN7android13trait_pointerINS_8hardware12ProcessState12handle_entryEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android8hardware12ProcessState12handle_entryE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerIPKvEE",
   "name" : "android::trait_pointer<const void *>",
   "referenced_type" : "_ZTIN7android13trait_pointerIPKvEE",
   "self_type" : "_ZTIN7android13trait_pointerIPKvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIPKv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerIPNS_7RefBase12weakref_typeEEE",
   "name" : "android::trait_pointer<android::RefBase::weakref_type *>",
   "referenced_type" : "_ZTIN7android13trait_pointerIPNS_7RefBase12weakref_typeEEE",
   "self_type" : "_ZTIN7android13trait_pointerIPNS_7RefBase12weakref_typeEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIPN7android7RefBase12weakref_typeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerIPNS_7RefBaseEEE",
   "name" : "android::trait_pointer<android::RefBase *>",
   "referenced_type" : "_ZTIN7android13trait_pointerIPNS_7RefBaseEEE",
   "self_type" : "_ZTIN7android13trait_pointerIPNS_7RefBaseEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIPN7android7RefBaseE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerIPNS_8hardware9BHwBinderEEE",
   "name" : "android::trait_pointer<android::hardware::BHwBinder *>",
   "referenced_type" : "_ZTIN7android13trait_pointerIPNS_8hardware9BHwBinderEEE",
   "self_type" : "_ZTIN7android13trait_pointerIPNS_8hardware9BHwBinderEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIPN7android8hardware9BHwBinderE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android13trait_pointerIiEE",
   "name" : "android::trait_pointer<int>",
   "referenced_type" : "_ZTIN7android13trait_pointerIiEE",
   "self_type" : "_ZTIN7android13trait_pointerIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android14ReferenceMoverE",
   "name" : "android::ReferenceMover",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android14ReferenceMoverE",
   "self_type" : "_ZTIN7android14ReferenceMoverE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIN7android16ReferenceRenamerE",
   "name" : "android::ReferenceRenamer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android16ReferenceRenamerE",
   "self_type" : "_ZTIN7android16ReferenceRenamerE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/RefBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16ReferenceRenamerE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ReferenceRenamerclEm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android10VectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android16SortedVectorImplE",
   "name" : "android::SortedVectorImpl",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android16SortedVectorImplE",
   "self_type" : "_ZTIN7android16SortedVectorImplE",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/VectorImpl.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16SortedVectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16SortedVectorImpl10do_compareEPKvS2_"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android16aggregate_traitsIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEE",
   "name" : "android::aggregate_traits<const void *, android::hardware::BpHwBinder::ObjectManager::entry_t>",
   "referenced_type" : "_ZTIN7android16aggregate_traitsIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEE",
   "self_type" : "_ZTIN7android16aggregate_traitsIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIPKv",
    "_ZTIN7android8hardware10BpHwBinder13ObjectManager7entry_tE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "key",
     "referenced_type" : "_ZTIPKv"
    },
    {
     "field_name" : "value",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android8hardware10BpHwBinder13ObjectManager7entry_tE"
    }
   ],
   "linker_set_key" : "_ZTIN7android16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEE",
   "name" : "android::key_value_pair_t<const void *, android::hardware::BpHwBinder::ObjectManager::entry_t>",
   "referenced_type" : "_ZTIN7android16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEE",
   "self_type" : "_ZTIN7android16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEE",
   "size" : 32,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIPKv",
    "_ZTIN7android8hardware10BpHwBinder13ObjectManager7entry_tE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android16use_trivial_moveINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEEE",
   "name" : "android::use_trivial_move<android::key_value_pair_t<const void *, android::hardware::BpHwBinder::ObjectManager::entry_t>>",
   "referenced_type" : "_ZTIN7android16use_trivial_moveINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEEE",
   "self_type" : "_ZTIN7android16use_trivial_moveINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIN7android16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android16use_trivial_moveINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEEE",
   "name" : "android::use_trivial_move<android::sp<android::hardware::BufferedTextOutput::BufferState>>",
   "referenced_type" : "_ZTIN7android16use_trivial_moveINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEEE",
   "self_type" : "_ZTIN7android16use_trivial_moveINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android2spINS_8hardware18BufferedTextOutput11BufferStateEEE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android16use_trivial_moveINS_8hardware10BpHwBinder8ObituaryEEE",
   "name" : "android::use_trivial_move<android::hardware::BpHwBinder::Obituary>",
   "referenced_type" : "_ZTIN7android16use_trivial_moveINS_8hardware10BpHwBinder8ObituaryEEE",
   "self_type" : "_ZTIN7android16use_trivial_moveINS_8hardware10BpHwBinder8ObituaryEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android8hardware10BpHwBinder8ObituaryE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android16use_trivial_moveINS_8hardware12ProcessState12handle_entryEEE",
   "name" : "android::use_trivial_move<android::hardware::ProcessState::handle_entry>",
   "referenced_type" : "_ZTIN7android16use_trivial_moveINS_8hardware12ProcessState12handle_entryEEE",
   "self_type" : "_ZTIN7android16use_trivial_moveINS_8hardware12ProcessState12handle_entryEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android8hardware12ProcessState12handle_entryE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android16use_trivial_moveIPNS_7RefBase12weakref_typeEEE",
   "name" : "android::use_trivial_move<android::RefBase::weakref_type *>",
   "referenced_type" : "_ZTIN7android16use_trivial_moveIPNS_7RefBase12weakref_typeEEE",
   "self_type" : "_ZTIN7android16use_trivial_moveIPNS_7RefBase12weakref_typeEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIPN7android7RefBase12weakref_typeE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android16use_trivial_moveIPNS_7RefBaseEEE",
   "name" : "android::use_trivial_move<android::RefBase *>",
   "referenced_type" : "_ZTIN7android16use_trivial_moveIPNS_7RefBaseEEE",
   "self_type" : "_ZTIN7android16use_trivial_moveIPNS_7RefBaseEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIPN7android7RefBaseE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android16use_trivial_moveIPNS_8hardware9BHwBinderEEE",
   "name" : "android::use_trivial_move<android::hardware::BHwBinder *>",
   "referenced_type" : "_ZTIN7android16use_trivial_moveIPNS_8hardware9BHwBinderEEE",
   "self_type" : "_ZTIN7android16use_trivial_moveIPNS_8hardware9BHwBinderEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIPN7android8hardware9BHwBinderE" ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android16use_trivial_moveIiEE",
   "name" : "android::use_trivial_move<int>",
   "referenced_type" : "_ZTIN7android16use_trivial_moveIiEE",
   "self_type" : "_ZTIN7android16use_trivial_moveIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEEE",
   "name" : "android::trait_trivial_copy<android::key_value_pair_t<const void *, android::hardware::BpHwBinder::ObjectManager::entry_t>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIN7android16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEEE",
   "name" : "android::trait_trivial_copy<android::sp<android::hardware::BufferedTextOutput::BufferState>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android2spINS_8hardware18BufferedTextOutput11BufferStateEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyINS_8hardware10BpHwBinder13ObjectManager7entry_tEEE",
   "name" : "android::trait_trivial_copy<android::hardware::BpHwBinder::ObjectManager::entry_t>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyINS_8hardware10BpHwBinder13ObjectManager7entry_tEEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyINS_8hardware10BpHwBinder13ObjectManager7entry_tEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android8hardware10BpHwBinder13ObjectManager7entry_tE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyINS_8hardware10BpHwBinder8ObituaryEEE",
   "name" : "android::trait_trivial_copy<android::hardware::BpHwBinder::Obituary>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyINS_8hardware10BpHwBinder8ObituaryEEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyINS_8hardware10BpHwBinder8ObituaryEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android8hardware10BpHwBinder8ObituaryE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyINS_8hardware12ProcessState12handle_entryEEE",
   "name" : "android::trait_trivial_copy<android::hardware::ProcessState::handle_entry>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyINS_8hardware12ProcessState12handle_entryEEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyINS_8hardware12ProcessState12handle_entryEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android8hardware12ProcessState12handle_entryE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIPKvEE",
   "name" : "android::trait_trivial_copy<const void *>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIPKvEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIPKvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIPKv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIPNS_7RefBase12weakref_typeEEE",
   "name" : "android::trait_trivial_copy<android::RefBase::weakref_type *>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIPNS_7RefBase12weakref_typeEEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIPNS_7RefBase12weakref_typeEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIPN7android7RefBase12weakref_typeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIPNS_7RefBaseEEE",
   "name" : "android::trait_trivial_copy<android::RefBase *>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIPNS_7RefBaseEEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIPNS_7RefBaseEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIPN7android7RefBaseE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIPNS_8hardware9BHwBinderEEE",
   "name" : "android::trait_trivial_copy<android::hardware::BHwBinder *>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIPNS_8hardware9BHwBinderEEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIPNS_8hardware9BHwBinderEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIPN7android8hardware9BHwBinderE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIbEE",
   "name" : "android::trait_trivial_copy<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIbEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIcEE",
   "name" : "android::trait_trivial_copy<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIcEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIdEE",
   "name" : "android::trait_trivial_copy<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIdEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIfEE",
   "name" : "android::trait_trivial_copy<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIfEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIhEE",
   "name" : "android::trait_trivial_copy<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIhEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIiEE",
   "name" : "android::trait_trivial_copy<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIjEE",
   "name" : "android::trait_trivial_copy<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIlEE",
   "name" : "android::trait_trivial_copy<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIlEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyImEE",
   "name" : "android::trait_trivial_copy<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyImEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyImEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIsEE",
   "name" : "android::trait_trivial_copy<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIsEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyItEE",
   "name" : "android::trait_trivial_copy<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyItEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyItEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIvEE",
   "name" : "android::trait_trivial_copy<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIxEE",
   "name" : "android::trait_trivial_copy<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIxEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIyEE",
   "name" : "android::trait_trivial_copy<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIyEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEEE",
   "name" : "android::trait_trivial_ctor<android::key_value_pair_t<const void *, android::hardware::BpHwBinder::ObjectManager::entry_t>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIN7android16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEEE",
   "name" : "android::trait_trivial_ctor<android::sp<android::hardware::BufferedTextOutput::BufferState>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android2spINS_8hardware18BufferedTextOutput11BufferStateEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorINS_8hardware10BpHwBinder13ObjectManager7entry_tEEE",
   "name" : "android::trait_trivial_ctor<android::hardware::BpHwBinder::ObjectManager::entry_t>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorINS_8hardware10BpHwBinder13ObjectManager7entry_tEEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorINS_8hardware10BpHwBinder13ObjectManager7entry_tEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android8hardware10BpHwBinder13ObjectManager7entry_tE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorINS_8hardware10BpHwBinder8ObituaryEEE",
   "name" : "android::trait_trivial_ctor<android::hardware::BpHwBinder::Obituary>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorINS_8hardware10BpHwBinder8ObituaryEEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorINS_8hardware10BpHwBinder8ObituaryEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android8hardware10BpHwBinder8ObituaryE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorINS_8hardware12ProcessState12handle_entryEEE",
   "name" : "android::trait_trivial_ctor<android::hardware::ProcessState::handle_entry>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorINS_8hardware12ProcessState12handle_entryEEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorINS_8hardware12ProcessState12handle_entryEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android8hardware12ProcessState12handle_entryE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIPKvEE",
   "name" : "android::trait_trivial_ctor<const void *>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIPKvEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIPKvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIPKv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIPNS_7RefBase12weakref_typeEEE",
   "name" : "android::trait_trivial_ctor<android::RefBase::weakref_type *>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIPNS_7RefBase12weakref_typeEEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIPNS_7RefBase12weakref_typeEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIPN7android7RefBase12weakref_typeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIPNS_7RefBaseEEE",
   "name" : "android::trait_trivial_ctor<android::RefBase *>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIPNS_7RefBaseEEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIPNS_7RefBaseEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIPN7android7RefBaseE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIPNS_8hardware9BHwBinderEEE",
   "name" : "android::trait_trivial_ctor<android::hardware::BHwBinder *>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIPNS_8hardware9BHwBinderEEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIPNS_8hardware9BHwBinderEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIPN7android8hardware9BHwBinderE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIbEE",
   "name" : "android::trait_trivial_ctor<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIbEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIcEE",
   "name" : "android::trait_trivial_ctor<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIcEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIdEE",
   "name" : "android::trait_trivial_ctor<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIdEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIfEE",
   "name" : "android::trait_trivial_ctor<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIfEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIhEE",
   "name" : "android::trait_trivial_ctor<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIhEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIiEE",
   "name" : "android::trait_trivial_ctor<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIjEE",
   "name" : "android::trait_trivial_ctor<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIlEE",
   "name" : "android::trait_trivial_ctor<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIlEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorImEE",
   "name" : "android::trait_trivial_ctor<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorImEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorImEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIsEE",
   "name" : "android::trait_trivial_ctor<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIsEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorItEE",
   "name" : "android::trait_trivial_ctor<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorItEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorItEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIvEE",
   "name" : "android::trait_trivial_ctor<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIxEE",
   "name" : "android::trait_trivial_ctor<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIxEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIyEE",
   "name" : "android::trait_trivial_ctor<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIyEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEEE",
   "name" : "android::trait_trivial_dtor<android::key_value_pair_t<const void *, android::hardware::BpHwBinder::ObjectManager::entry_t>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIN7android16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEEE",
   "name" : "android::trait_trivial_dtor<android::sp<android::hardware::BufferedTextOutput::BufferState>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android2spINS_8hardware18BufferedTextOutput11BufferStateEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorINS_8hardware10BpHwBinder13ObjectManager7entry_tEEE",
   "name" : "android::trait_trivial_dtor<android::hardware::BpHwBinder::ObjectManager::entry_t>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorINS_8hardware10BpHwBinder13ObjectManager7entry_tEEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorINS_8hardware10BpHwBinder13ObjectManager7entry_tEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android8hardware10BpHwBinder13ObjectManager7entry_tE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorINS_8hardware10BpHwBinder8ObituaryEEE",
   "name" : "android::trait_trivial_dtor<android::hardware::BpHwBinder::Obituary>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorINS_8hardware10BpHwBinder8ObituaryEEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorINS_8hardware10BpHwBinder8ObituaryEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android8hardware10BpHwBinder8ObituaryE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorINS_8hardware12ProcessState12handle_entryEEE",
   "name" : "android::trait_trivial_dtor<android::hardware::ProcessState::handle_entry>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorINS_8hardware12ProcessState12handle_entryEEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorINS_8hardware12ProcessState12handle_entryEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android8hardware12ProcessState12handle_entryE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIPKvEE",
   "name" : "android::trait_trivial_dtor<const void *>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIPKvEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIPKvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIPKv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIPNS_7RefBase12weakref_typeEEE",
   "name" : "android::trait_trivial_dtor<android::RefBase::weakref_type *>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIPNS_7RefBase12weakref_typeEEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIPNS_7RefBase12weakref_typeEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIPN7android7RefBase12weakref_typeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIPNS_7RefBaseEEE",
   "name" : "android::trait_trivial_dtor<android::RefBase *>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIPNS_7RefBaseEEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIPNS_7RefBaseEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIPN7android7RefBaseE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIPNS_8hardware9BHwBinderEEE",
   "name" : "android::trait_trivial_dtor<android::hardware::BHwBinder *>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIPNS_8hardware9BHwBinderEEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIPNS_8hardware9BHwBinderEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIPN7android8hardware9BHwBinderE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIbEE",
   "name" : "android::trait_trivial_dtor<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIbEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIcEE",
   "name" : "android::trait_trivial_dtor<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIcEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIdEE",
   "name" : "android::trait_trivial_dtor<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIdEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIfEE",
   "name" : "android::trait_trivial_dtor<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIfEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIhEE",
   "name" : "android::trait_trivial_dtor<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIhEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIiEE",
   "name" : "android::trait_trivial_dtor<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIjEE",
   "name" : "android::trait_trivial_dtor<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIlEE",
   "name" : "android::trait_trivial_dtor<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIlEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorImEE",
   "name" : "android::trait_trivial_dtor<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorImEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorImEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIsEE",
   "name" : "android::trait_trivial_dtor<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIsEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorItEE",
   "name" : "android::trait_trivial_dtor<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorItEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorItEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIvEE",
   "name" : "android::trait_trivial_dtor<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIxEE",
   "name" : "android::trait_trivial_dtor<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIxEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIyEE",
   "name" : "android::trait_trivial_dtor<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIyEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEEE",
   "name" : "android::trait_trivial_move<android::key_value_pair_t<const void *, android::hardware::BpHwBinder::ObjectManager::entry_t>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIN7android16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEEE",
   "name" : "android::trait_trivial_move<android::sp<android::hardware::BufferedTextOutput::BufferState>>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android2spINS_8hardware18BufferedTextOutput11BufferStateEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveINS_7String8EEE",
   "name" : "android::trait_trivial_move<android::String8>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveINS_7String8EEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveINS_7String8EEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/String8.h",
   "template_args" : [ "_ZTIN7android7String8E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveINS_8String16EEE",
   "name" : "android::trait_trivial_move<android::String16>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveINS_8String16EEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveINS_8String16EEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/String16.h",
   "template_args" : [ "_ZTIN7android8String16E" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveINS_8hardware10BpHwBinder13ObjectManager7entry_tEEE",
   "name" : "android::trait_trivial_move<android::hardware::BpHwBinder::ObjectManager::entry_t>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveINS_8hardware10BpHwBinder13ObjectManager7entry_tEEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveINS_8hardware10BpHwBinder13ObjectManager7entry_tEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android8hardware10BpHwBinder13ObjectManager7entry_tE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveINS_8hardware10BpHwBinder8ObituaryEEE",
   "name" : "android::trait_trivial_move<android::hardware::BpHwBinder::Obituary>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveINS_8hardware10BpHwBinder8ObituaryEEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveINS_8hardware10BpHwBinder8ObituaryEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android8hardware10BpHwBinder8ObituaryE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveINS_8hardware12ProcessState12handle_entryEEE",
   "name" : "android::trait_trivial_move<android::hardware::ProcessState::handle_entry>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveINS_8hardware12ProcessState12handle_entryEEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveINS_8hardware12ProcessState12handle_entryEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android8hardware12ProcessState12handle_entryE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIPKvEE",
   "name" : "android::trait_trivial_move<const void *>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIPKvEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIPKvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIPKv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIPNS_7RefBase12weakref_typeEEE",
   "name" : "android::trait_trivial_move<android::RefBase::weakref_type *>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIPNS_7RefBase12weakref_typeEEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIPNS_7RefBase12weakref_typeEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIPN7android7RefBase12weakref_typeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIPNS_7RefBaseEEE",
   "name" : "android::trait_trivial_move<android::RefBase *>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIPNS_7RefBaseEEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIPNS_7RefBaseEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIPN7android7RefBaseE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIPNS_8hardware9BHwBinderEEE",
   "name" : "android::trait_trivial_move<android::hardware::BHwBinder *>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIPNS_8hardware9BHwBinderEEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIPNS_8hardware9BHwBinderEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIPN7android8hardware9BHwBinderE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIbEE",
   "name" : "android::trait_trivial_move<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIbEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIb" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIcEE",
   "name" : "android::trait_trivial_move<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIcEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIc" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIdEE",
   "name" : "android::trait_trivial_move<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIdEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTId" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIfEE",
   "name" : "android::trait_trivial_move<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIfEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIf" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIhEE",
   "name" : "android::trait_trivial_move<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIhEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIh" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIiEE",
   "name" : "android::trait_trivial_move<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIjEE",
   "name" : "android::trait_trivial_move<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIj" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIlEE",
   "name" : "android::trait_trivial_move<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIlEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIl" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveImEE",
   "name" : "android::trait_trivial_move<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveImEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveImEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIm" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIsEE",
   "name" : "android::trait_trivial_move<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIsEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIs" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveItEE",
   "name" : "android::trait_trivial_move<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveItEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveItEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIt" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIvEE",
   "name" : "android::trait_trivial_move<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIxEE",
   "name" : "android::trait_trivial_move<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIxEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIx" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIyEE",
   "name" : "android::trait_trivial_move<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIyEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIy" ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android19VirtualLightRefBaseE",
   "name" : "android::VirtualLightRefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android19VirtualLightRefBaseE",
   "self_type" : "_ZTIN7android19VirtualLightRefBaseE",
   "size" : 16,
   "source_file" : "system/core/libutils/include/utils/LightRefBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android19VirtualLightRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android6ThreadE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_6ThreadEEE",
   "name" : "android::sp<android::Thread>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_6ThreadEEE",
   "self_type" : "_ZTIN7android2spINS_6ThreadEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android6ThreadE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware10IInterfaceE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware10IInterfaceEEE",
   "name" : "android::sp<android::hardware::IInterface>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware10IInterfaceEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware10IInterfaceEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android8hardware10IInterfaceE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware12ProcessStateE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware12ProcessStateEEE",
   "name" : "android::sp<android::hardware::ProcessState>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware12ProcessStateEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware12ProcessStateEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android8hardware12ProcessStateE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware18BufferedTextOutput11BufferStateE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware18BufferedTextOutput11BufferStateEEE",
   "name" : "android::sp<android::hardware::BufferedTextOutput::BufferState>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware18BufferedTextOutput11BufferStateEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware18BufferedTextOutput11BufferStateEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android8hardware18BufferedTextOutput11BufferStateE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware7IBinder14DeathRecipientE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware7IBinder14DeathRecipientEEE",
   "name" : "android::sp<android::hardware::IBinder::DeathRecipient>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware7IBinder14DeathRecipientEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware7IBinder14DeathRecipientEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android8hardware7IBinder14DeathRecipientE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware7IBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware7IBinderEEE",
   "name" : "android::sp<android::hardware::IBinder>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware7IBinderEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware7IBinderEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android8hardware7IBinderE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware9BHwBinderE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware9BHwBinderEEE",
   "name" : "android::sp<android::hardware::BHwBinder>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_8hardware9BHwBinderEEE",
   "self_type" : "_ZTIN7android2spINS_8hardware9BHwBinderEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "_ZTIN7android8hardware9BHwBinderE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware7IBinder14DeathRecipientE"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN7android7RefBase12weakref_typeE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2wpINS_8hardware7IBinder14DeathRecipientEEE",
   "name" : "android::wp<android::hardware::IBinder::DeathRecipient>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2wpINS_8hardware7IBinder14DeathRecipientEEE",
   "self_type" : "_ZTIN7android2wpINS_8hardware7IBinder14DeathRecipientEEE",
   "size" : 16,
   "source_file" : "system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "_ZTIN7android8hardware7IBinder14DeathRecipientE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware7IBinderE"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN7android7RefBase12weakref_typeE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2wpINS_8hardware7IBinderEEE",
   "name" : "android::wp<android::hardware::IBinder>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2wpINS_8hardware7IBinderEEE",
   "self_type" : "_ZTIN7android2wpINS_8hardware7IBinderEEE",
   "size" : 16,
   "source_file" : "system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "_ZTIN7android8hardware7IBinderE" ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "_ZTIRN7android5MutexE"
    }
   ],
   "linker_set_key" : "_ZTIN7android5Mutex8AutolockE",
   "name" : "android::Mutex::Autolock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android5Mutex8AutolockE",
   "self_type" : "_ZTIN7android5Mutex8AutolockE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/Mutex.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "_ZTI15pthread_mutex_t"
    }
   ],
   "linker_set_key" : "_ZTIN7android5MutexE",
   "name" : "android::Mutex",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android5MutexE",
   "self_type" : "_ZTIN7android5MutexE",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/Mutex.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "_ZTIRN7android6RWLockE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6RWLock9AutoRLockE",
   "name" : "android::RWLock::AutoRLock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6RWLock9AutoRLockE",
   "self_type" : "_ZTIN7android6RWLock9AutoRLockE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/RWLock.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "_ZTIRN7android6RWLockE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6RWLock9AutoWLockE",
   "name" : "android::RWLock::AutoWLock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6RWLock9AutoWLockE",
   "self_type" : "_ZTIN7android6RWLock9AutoWLockE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/RWLock.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRWLock",
     "referenced_type" : "_ZTI16pthread_rwlock_t"
    }
   ],
   "linker_set_key" : "_ZTIN7android6RWLockE",
   "name" : "android::RWLock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6RWLockE",
   "self_type" : "_ZTIN7android6RWLockE",
   "size" : 56,
   "source_file" : "system/core/libutils/include/utils/RWLock.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCanCallJava",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKb"
    },
    {
     "access" : "private",
     "field_name" : "mThread",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN7android5MutexE"
    },
    {
     "access" : "private",
     "field_name" : "mThreadExitedCondition",
     "field_offset" : 512,
     "referenced_type" : "_ZTIN7android9ConditionE"
    },
    {
     "access" : "private",
     "field_name" : "mStatus",
     "field_offset" : 896,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mExitPending",
     "field_offset" : 928,
     "referenced_type" : "_ZTIVb"
    },
    {
     "access" : "private",
     "field_name" : "mRunning",
     "field_offset" : 936,
     "referenced_type" : "_ZTIVb"
    },
    {
     "access" : "private",
     "field_name" : "mHoldSelf",
     "field_offset" : 960,
     "referenced_type" : "_ZTIN7android2spINS_6ThreadEEE"
    },
    {
     "access" : "private",
     "field_name" : "mTid",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7android6ThreadE",
   "name" : "android::Thread",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6ThreadE",
   "self_type" : "_ZTIN7android6ThreadE",
   "size" : 152,
   "source_file" : "system/core/libutils/include/utils/Thread.h",
   "vtable_components" :
   [
    {
     "component_value" : 136,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6ThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6ThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6ThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread3runEPKcim"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread11requestExitEv"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread10readyToRunEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android6Thread10threadLoopEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -136,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -136,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6ThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android6ThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android6ThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android10VectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6VectorINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEEE",
   "name" : "android::Vector<android::sp<android::hardware::BufferedTextOutput::BufferState>>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6VectorINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEEE",
   "self_type" : "_ZTIN7android6VectorINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEEE",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "_ZTIN7android2spINS_8hardware18BufferedTextOutput11BufferStateEEE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEE16do_move_backwardEPvPKvm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android10VectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6VectorINS_7String8EEE",
   "name" : "android::Vector<android::String8>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6VectorINS_7String8EEE",
   "self_type" : "_ZTIN7android6VectorINS_7String8EEE",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "_ZTIN7android7String8E" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorINS_7String8EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_7String8EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_7String8EED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_7String8EE16do_move_backwardEPvPKvm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android10VectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6VectorINS_8hardware10BpHwBinder8ObituaryEEE",
   "name" : "android::Vector<android::hardware::BpHwBinder::Obituary>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6VectorINS_8hardware10BpHwBinder8ObituaryEEE",
   "self_type" : "_ZTIN7android6VectorINS_8hardware10BpHwBinder8ObituaryEEE",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "_ZTIN7android8hardware10BpHwBinder8ObituaryE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorINS_8hardware10BpHwBinder8ObituaryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_8hardware10BpHwBinder8ObituaryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_8hardware10BpHwBinder8ObituaryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware10BpHwBinder8ObituaryEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware10BpHwBinder8ObituaryEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware10BpHwBinder8ObituaryEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware10BpHwBinder8ObituaryEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware10BpHwBinder8ObituaryEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware10BpHwBinder8ObituaryEE16do_move_backwardEPvPKvm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android10VectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6VectorINS_8hardware12ProcessState12handle_entryEEE",
   "name" : "android::Vector<android::hardware::ProcessState::handle_entry>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6VectorINS_8hardware12ProcessState12handle_entryEEE",
   "self_type" : "_ZTIN7android6VectorINS_8hardware12ProcessState12handle_entryEEE",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "_ZTIN7android8hardware12ProcessState12handle_entryE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorINS_8hardware12ProcessState12handle_entryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_8hardware12ProcessState12handle_entryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_8hardware12ProcessState12handle_entryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE16do_move_backwardEPvPKvm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android10VectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6VectorIPNS_7RefBase12weakref_typeEEE",
   "name" : "android::Vector<android::RefBase::weakref_type *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6VectorIPNS_7RefBase12weakref_typeEEE",
   "self_type" : "_ZTIN7android6VectorIPNS_7RefBase12weakref_typeEEE",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "_ZTIPN7android7RefBase12weakref_typeE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorIPNS_7RefBase12weakref_typeEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorIPNS_7RefBase12weakref_typeEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorIPNS_7RefBase12weakref_typeEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBase12weakref_typeEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBase12weakref_typeEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBase12weakref_typeEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBase12weakref_typeEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBase12weakref_typeEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBase12weakref_typeEE16do_move_backwardEPvPKvm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android10VectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6VectorIPNS_7RefBaseEEE",
   "name" : "android::Vector<android::RefBase *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6VectorIPNS_7RefBaseEEE",
   "self_type" : "_ZTIN7android6VectorIPNS_7RefBaseEEE",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "_ZTIPN7android7RefBaseE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorIPNS_7RefBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorIPNS_7RefBaseEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorIPNS_7RefBaseEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBaseEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBaseEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBaseEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBaseEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBaseEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_7RefBaseEE16do_move_backwardEPvPKvm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android10VectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6VectorIPNS_8hardware9BHwBinderEEE",
   "name" : "android::Vector<android::hardware::BHwBinder *>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6VectorIPNS_8hardware9BHwBinderEEE",
   "self_type" : "_ZTIN7android6VectorIPNS_8hardware9BHwBinderEEE",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "_ZTIPN7android8hardware9BHwBinderE" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorIPNS_8hardware9BHwBinderEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorIPNS_8hardware9BHwBinderEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorIPNS_8hardware9BHwBinderEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_8hardware9BHwBinderEE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_8hardware9BHwBinderEE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_8hardware9BHwBinderEE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_8hardware9BHwBinderEE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_8hardware9BHwBinderEE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIPNS_8hardware9BHwBinderEE16do_move_backwardEPvPKvm"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android10VectorImplE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6VectorIiEE",
   "name" : "android::Vector<int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6VectorIiEE",
   "self_type" : "_ZTIN7android6VectorIiEE",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "_ZTIi" ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorIiEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorIiED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorIiED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIiE12do_constructEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIiE10do_destroyEPvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIiE7do_copyEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIiE8do_splatEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIiE15do_move_forwardEPvPKvm"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorIiE16do_move_backwardEPvPKvm"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android6traitsINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEEE",
   "name" : "android::traits<android::key_value_pair_t<const void *, android::hardware::BpHwBinder::ObjectManager::entry_t>>",
   "referenced_type" : "_ZTIN7android6traitsINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEEE",
   "self_type" : "_ZTIN7android6traitsINS_16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIN7android16key_value_pair_tIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android6traitsINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEEE",
   "name" : "android::traits<android::sp<android::hardware::BufferedTextOutput::BufferState>>",
   "referenced_type" : "_ZTIN7android6traitsINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEEE",
   "self_type" : "_ZTIN7android6traitsINS_2spINS_8hardware18BufferedTextOutput11BufferStateEEEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android2spINS_8hardware18BufferedTextOutput11BufferStateEEE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android6traitsINS_8hardware10BpHwBinder13ObjectManager7entry_tEEE",
   "name" : "android::traits<android::hardware::BpHwBinder::ObjectManager::entry_t>",
   "referenced_type" : "_ZTIN7android6traitsINS_8hardware10BpHwBinder13ObjectManager7entry_tEEE",
   "self_type" : "_ZTIN7android6traitsINS_8hardware10BpHwBinder13ObjectManager7entry_tEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android8hardware10BpHwBinder13ObjectManager7entry_tE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android6traitsINS_8hardware10BpHwBinder8ObituaryEEE",
   "name" : "android::traits<android::hardware::BpHwBinder::Obituary>",
   "referenced_type" : "_ZTIN7android6traitsINS_8hardware10BpHwBinder8ObituaryEEE",
   "self_type" : "_ZTIN7android6traitsINS_8hardware10BpHwBinder8ObituaryEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android8hardware10BpHwBinder8ObituaryE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android6traitsINS_8hardware12ProcessState12handle_entryEEE",
   "name" : "android::traits<android::hardware::ProcessState::handle_entry>",
   "referenced_type" : "_ZTIN7android6traitsINS_8hardware12ProcessState12handle_entryEEE",
   "self_type" : "_ZTIN7android6traitsINS_8hardware12ProcessState12handle_entryEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIN7android8hardware12ProcessState12handle_entryE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android6traitsIPKvEE",
   "name" : "android::traits<const void *>",
   "referenced_type" : "_ZTIN7android6traitsIPKvEE",
   "self_type" : "_ZTIN7android6traitsIPKvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIPKv" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android6traitsIPNS_7RefBase12weakref_typeEEE",
   "name" : "android::traits<android::RefBase::weakref_type *>",
   "referenced_type" : "_ZTIN7android6traitsIPNS_7RefBase12weakref_typeEEE",
   "self_type" : "_ZTIN7android6traitsIPNS_7RefBase12weakref_typeEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIPN7android7RefBase12weakref_typeE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android6traitsIPNS_7RefBaseEEE",
   "name" : "android::traits<android::RefBase *>",
   "referenced_type" : "_ZTIN7android6traitsIPNS_7RefBaseEEE",
   "self_type" : "_ZTIN7android6traitsIPNS_7RefBaseEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIPN7android7RefBaseE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android6traitsIPNS_8hardware9BHwBinderEEE",
   "name" : "android::traits<android::hardware::BHwBinder *>",
   "referenced_type" : "_ZTIN7android6traitsIPNS_8hardware9BHwBinderEEE",
   "self_type" : "_ZTIN7android6traitsIPNS_8hardware9BHwBinderEEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIPN7android8hardware9BHwBinderE" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android6traitsIiEE",
   "name" : "android::traits<int>",
   "referenced_type" : "_ZTIN7android6traitsIiEE",
   "self_type" : "_ZTIN7android6traitsIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "_ZTIi" ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7RefBase12weakref_typeE",
   "name" : "android::RefBase::weakref_type",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7RefBase12weakref_typeE",
   "self_type" : "_ZTIN7android7RefBase12weakref_typeE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKPN7android7RefBase12weakref_implE"
    }
   ],
   "linker_set_key" : "_ZTIN7android7RefBaseE",
   "name" : "android::RefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7RefBaseE",
   "self_type" : "_ZTIN7android7RefBaseE",
   "size" : 16,
   "source_file" : "system/core/libutils/include/utils/RefBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7RefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTIN7android7String8E",
   "name" : "android::String8",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7String8E",
   "self_type" : "_ZTIN7android7String8E",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/String8.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "_ZTIPKDs"
    }
   ],
   "linker_set_key" : "_ZTIN7android8String16E",
   "name" : "android::String16",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8String16E",
   "self_type" : "_ZTIN7android8String16E",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/String16.h"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "object",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "cleanupCookie",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "func",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFvPKvPvS1_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware10BpHwBinder13ObjectManager7entry_tE",
   "name" : "android::hardware::BpHwBinder::ObjectManager::entry_t",
   "referenced_type" : "_ZTIN7android8hardware10BpHwBinder13ObjectManager7entry_tE",
   "self_type" : "_ZTIN7android8hardware10BpHwBinder13ObjectManager7entry_tE",
   "size" : 24,
   "source_file" : "system/libhwbinder/include/hwbinder/BpHwBinder.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mObjects",
     "referenced_type" : "_ZTIN7android11KeyedVectorIPKvNS_8hardware10BpHwBinder13ObjectManager7entry_tEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware10BpHwBinder13ObjectManagerE",
   "name" : "android::hardware::BpHwBinder::ObjectManager",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware10BpHwBinder13ObjectManagerE",
   "self_type" : "_ZTIN7android8hardware10BpHwBinder13ObjectManagerE",
   "size" : 40,
   "source_file" : "system/libhwbinder/include/hwbinder/BpHwBinder.h"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "recipient",
     "referenced_type" : "_ZTIN7android2wpINS_8hardware7IBinder14DeathRecipientEEE"
    },
    {
     "field_name" : "cookie",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "flags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware10BpHwBinder8ObituaryE",
   "name" : "android::hardware::BpHwBinder::Obituary",
   "referenced_type" : "_ZTIN7android8hardware10BpHwBinder8ObituaryE",
   "self_type" : "_ZTIN7android8hardware10BpHwBinder8ObituaryE",
   "size" : 32,
   "source_file" : "system/libhwbinder/include/hwbinder/BpHwBinder.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware7IBinderE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKi"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN7android5MutexE"
    },
    {
     "access" : "private",
     "field_name" : "mAlive",
     "field_offset" : 416,
     "referenced_type" : "_ZTIVi"
    },
    {
     "access" : "private",
     "field_name" : "mObitsSent",
     "field_offset" : 448,
     "referenced_type" : "_ZTIVi"
    },
    {
     "access" : "private",
     "field_name" : "mObituaries",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPN7android6VectorINS_8hardware10BpHwBinder8ObituaryEEE"
    },
    {
     "access" : "private",
     "field_name" : "mObjects",
     "field_offset" : 576,
     "referenced_type" : "_ZTIN7android8hardware10BpHwBinder13ObjectManagerE"
    },
    {
     "access" : "private",
     "field_name" : "mDescriptorCache",
     "field_offset" : 896,
     "referenced_type" : "_ZTIN7android8String16E"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware10BpHwBinderE",
   "name" : "android::hardware::BpHwBinder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware10BpHwBinderE",
   "self_type" : "_ZTIN7android8hardware10BpHwBinderE",
   "size" : 136,
   "source_file" : "system/libhwbinder/include/hwbinder/BpHwBinder.h",
   "vtable_components" :
   [
    {
     "component_value" : 120,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10BpHwBinderE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware10BpHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware10BpHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware10BpHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware10BpHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware10BpHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware10BpHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware10BpHwBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10BpHwBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10BpHwBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware10BpHwBinder10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware10BpHwBinder15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware10BpHwBinder20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -120,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -120,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -120,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -120,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -120,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10BpHwBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware10BpHwBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware10BpHwBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n32_N7android8hardware10BpHwBinder10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n40_N7android8hardware10BpHwBinder15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n48_N7android8hardware10BpHwBinder20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware10IInterfaceE",
   "name" : "android::hardware::IInterface",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware10IInterfaceE",
   "self_type" : "_ZTIN7android8hardware10IInterfaceE",
   "size" : 24,
   "source_file" : "system/libhwbinder/include/hwbinder/IInterface.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10IInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware10IInterface10onAsBinderEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware10IInterfaceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRemote",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKPN7android8hardware7IBinderE"
    },
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPN7android7RefBase12weakref_typeE"
    },
    {
     "access" : "private",
     "field_name" : "mState",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16atomicIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware11BpHwRefBaseE",
   "name" : "android::hardware::BpHwRefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware11BpHwRefBaseE",
   "self_type" : "_ZTIN7android8hardware11BpHwRefBaseE",
   "size" : 48,
   "source_file" : "system/libhwbinder/include/hwbinder/Binder.h",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpHwRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpHwRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n32_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n40_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n48_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "binder",
     "referenced_type" : "_ZTIPN7android8hardware7IBinderE"
    },
    {
     "field_name" : "refs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN7android7RefBase12weakref_typeE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware12ProcessState12handle_entryE",
   "name" : "android::hardware::ProcessState::handle_entry",
   "referenced_type" : "_ZTIN7android8hardware12ProcessState12handle_entryE",
   "self_type" : "_ZTIN7android8hardware12ProcessState12handle_entryE",
   "size" : 16,
   "source_file" : "system/libhwbinder/include/hwbinder/ProcessState.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mDriverFD",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mVMStart",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "mThreadCountLock",
     "field_offset" : 192,
     "referenced_type" : "_ZTI15pthread_mutex_t"
    },
    {
     "access" : "private",
     "field_name" : "mExecutingThreadsCount",
     "field_offset" : 512,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mMaxThreads",
     "field_offset" : 576,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mStarvationStartTimeMs",
     "field_offset" : 640,
     "referenced_type" : "_ZTIl"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 704,
     "referenced_type" : "_ZTIN7android5MutexE"
    },
    {
     "access" : "private",
     "field_name" : "mHandleToObject",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIN7android6VectorINS_8hardware12ProcessState12handle_entryEEE"
    },
    {
     "access" : "private",
     "field_name" : "mRootDir",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIN7android7String8E"
    },
    {
     "access" : "private",
     "field_name" : "mThreadPoolStarted",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mSpawnThreadOnStart",
     "field_offset" : 1416,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mThreadPoolSeq",
     "field_offset" : 1440,
     "referenced_type" : "_ZTIVi"
    },
    {
     "access" : "private",
     "field_name" : "mMmapSize",
     "field_offset" : 1472,
     "referenced_type" : "_ZTIKm"
    },
    {
     "access" : "private",
     "field_name" : "mCallRestriction",
     "field_offset" : 1536,
     "referenced_type" : "_ZTIN7android8hardware12ProcessState15CallRestrictionE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware12ProcessStateE",
   "name" : "android::hardware::ProcessState",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware12ProcessStateE",
   "self_type" : "_ZTIN7android8hardware12ProcessStateE",
   "size" : 216,
   "source_file" : "system/libhwbinder/include/hwbinder/ProcessState.h",
   "vtable_components" :
   [
    {
     "component_value" : 200,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware12ProcessStateE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware12ProcessStateD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware12ProcessStateD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -200,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -200,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware12ProcessStateE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware12ProcessStateD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware12ProcessStateD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mProcess",
     "referenced_type" : "_ZTIKN7android2spINS_8hardware12ProcessStateEEE"
    },
    {
     "access" : "private",
     "field_name" : "mPendingStrongDerefs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android6VectorIPNS_8hardware9BHwBinderEEE"
    },
    {
     "access" : "private",
     "field_name" : "mPendingWeakDerefs",
     "field_offset" : 384,
     "referenced_type" : "_ZTIN7android6VectorIPNS_7RefBase12weakref_typeEEE"
    },
    {
     "access" : "private",
     "field_name" : "mPostWriteStrongDerefs",
     "field_offset" : 704,
     "referenced_type" : "_ZTIN7android6VectorIPNS_7RefBaseEEE"
    },
    {
     "access" : "private",
     "field_name" : "mPostWriteWeakDerefs",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIN7android6VectorIPNS_7RefBase12weakref_typeEEE"
    },
    {
     "access" : "private",
     "field_name" : "mIn",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIN7android8hardware6ParcelE"
    },
    {
     "access" : "private",
     "field_name" : "mOut",
     "field_offset" : 2432,
     "referenced_type" : "_ZTIN7android8hardware6ParcelE"
    },
    {
     "access" : "private",
     "field_name" : "mLastError",
     "field_offset" : 3520,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mServingStackPointer",
     "field_offset" : 3584,
     "referenced_type" : "_ZTIPKv"
    },
    {
     "access" : "private",
     "field_name" : "mCallingPid",
     "field_offset" : 3648,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mCallingSid",
     "field_offset" : 3712,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_name" : "mCallingUid",
     "field_offset" : 3776,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mStrictModePolicy",
     "field_offset" : 3808,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mLastTransactionBinderFlags",
     "field_offset" : 3840,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mIsLooper",
     "field_offset" : 3872,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mIsPollingThread",
     "field_offset" : 3880,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mPostCommandTasks",
     "field_offset" : 3904,
     "referenced_type" : "_ZTINSt3__16vectorINS_8functionIFvvEEENS_9allocatorIS3_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "mCallRestriction",
     "field_offset" : 4096,
     "referenced_type" : "_ZTIN7android8hardware12ProcessState15CallRestrictionE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware14IPCThreadStateE",
   "name" : "android::hardware::IPCThreadState",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware14IPCThreadStateE",
   "self_type" : "_ZTIN7android8hardware14IPCThreadStateE",
   "size" : 520,
   "source_file" : "system/libhwbinder/include/hwbinder/IPCThreadState.h"
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "index",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "bufend",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6Parcel10BufferInfoE",
   "name" : "android::hardware::Parcel::BufferInfo",
   "referenced_type" : "_ZTIN7android8hardware6Parcel10BufferInfoE",
   "self_type" : "_ZTIN7android8hardware6Parcel10BufferInfoE",
   "size" : 24,
   "source_file" : "system/libhwbinder/include/hwbinder/Parcel.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBufCachePos",
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mBufCache",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__16vectorIN7android8hardware6Parcel10BufferInfoENS_9allocatorIS4_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "mError",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPh"
    },
    {
     "access" : "private",
     "field_name" : "mDataSize",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mDataCapacity",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mDataPos",
     "field_offset" : 512,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mObjects",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPy"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsSize",
     "field_offset" : 640,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsCapacity",
     "field_offset" : 704,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mNextObjectHint",
     "field_offset" : 768,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mNumRef",
     "field_offset" : 832,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mFdsKnown",
     "field_offset" : 896,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mHasFds",
     "field_offset" : 904,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mAllowFds",
     "field_offset" : 912,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mDeallocZero",
     "field_offset" : 920,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mOwner",
     "field_offset" : 960,
     "referenced_type" : "_ZTIPFvPN7android8hardware6ParcelEPKhmPKymPvE"
    },
    {
     "access" : "private",
     "field_name" : "mOwnerCookie",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6ParcelE",
   "name" : "android::hardware::Parcel",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware6ParcelE",
   "self_type" : "_ZTIN7android8hardware6ParcelE",
   "size" : 136,
   "source_file" : "system/libhwbinder/include/hwbinder/Parcel.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7IBinder14DeathRecipientE",
   "name" : "android::hardware::IBinder::DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware7IBinder14DeathRecipientE",
   "self_type" : "_ZTIN7android8hardware7IBinder14DeathRecipientE",
   "size" : 24,
   "source_file" : "system/libhwbinder/include/hwbinder/IBinder.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinder14DeathRecipientE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder14DeathRecipient10binderDiedERKNS_2wpIS1_EE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinder14DeathRecipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinder14DeathRecipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware7IBinder14DeathRecipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7IBinderE",
   "name" : "android::hardware::IBinder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware7IBinderE",
   "self_type" : "_ZTIN7android8hardware7IBinderE",
   "size" : 24,
   "source_file" : "system/libhwbinder/include/hwbinder/IBinder.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinderE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder11linkToDeathERKNS_2spINS1_14DeathRecipientEEEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder13unlinkToDeathERKNS_2wpINS1_14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android8hardware7IBinder10findObjectEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinderD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware7IBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware7IBinderE"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mSchedPolicy",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "protected",
     "field_name" : "mSchedPriority",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mExtras",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__16atomicIPN7android8hardware9BHwBinder6ExtrasEEE"
    },
    {
     "access" : "private",
     "field_name" : "mReserved0",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware9BHwBinderE",
   "name" : "android::hardware::BHwBinder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8hardware9BHwBinderE",
   "self_type" : "_ZTIN7android8hardware9BHwBinderE",
   "size" : 48,
   "source_file" : "system/libhwbinder/include/hwbinder/Binder.h",
   "vtable_components" :
   [
    {
     "component_value" : 32,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware9BHwBinderE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware9BHwBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware9BHwBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder10onTransactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -32,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware9BHwBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware9BHwBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware9BHwBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android9CallStack12StackDeleterE",
   "name" : "android::CallStack::StackDeleter",
   "referenced_type" : "_ZTIN7android9CallStack12StackDeleterE",
   "self_type" : "_ZTIN7android9CallStack12StackDeleterE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/CallStack.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFrameLines",
     "referenced_type" : "_ZTIN7android6VectorINS_7String8EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android9CallStackE",
   "name" : "android::CallStack",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android9CallStackE",
   "self_type" : "_ZTIN7android9CallStackE",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/CallStack.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCond",
     "referenced_type" : "_ZTI14pthread_cond_t"
    }
   ],
   "linker_set_key" : "_ZTIN7android9ConditionE",
   "name" : "android::Condition",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android9ConditionE",
   "self_type" : "_ZTIN7android9ConditionE",
   "size" : 48,
   "source_file" : "system/core/libutils/include/utils/Condition.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIA5121_h"
    },
    {
     "field_name" : "entry",
     "referenced_type" : "_ZTI12logger_entry"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7log_msgUt_E",
   "name" : "log_msg::(anonymous union at system/logging/liblog/include_vndk/log/log_read.h:58:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7log_msgUt_E",
   "self_type" : "_ZTIN7log_msgUt_E",
   "size" : 5124,
   "source_file" : "system/logging/liblog/include_vndk/log/log_read.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android16ReferenceRenamerE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "d_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPN7android2spINS_8hardware18BufferedTextOutput11BufferStateEEE"
    },
    {
     "access" : "private",
     "field_name" : "s_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKN7android2spINS_8hardware18BufferedTextOutput11BufferStateEEE"
    }
   ],
   "linker_set_key" : "_ZTIZN7android14ReferenceMover15move_referencesINS_8hardware18BufferedTextOutput11BufferStateEEEvPNS_2spIT_EEPKS7_mE7Renamer",
   "name" : "Renamer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIZN7android14ReferenceMover15move_referencesINS_8hardware18BufferedTextOutput11BufferStateEEEvPNS_2spIT_EEPKS7_mE7Renamer",
   "self_type" : "_ZTIZN7android14ReferenceMover15move_referencesINS_8hardware18BufferedTextOutput11BufferStateEEEvPNS_2spIT_EEPKS7_mE7Renamer",
   "size" : 24,
   "source_file" : "system/core/libutils/include/utils/RefBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIZN7android14ReferenceMover15move_referencesINS_8hardware18BufferedTextOutput11BufferStateEEEvPNS_2spIT_EEPKS7_mE7Renamer"
    },
    {
     "mangled_component_name" : "_ZZN7android14ReferenceMover15move_referencesINS_8hardware18BufferedTextOutput11BufferStateEEEvPNS_2spIT_EEPKS7_mENK7RenamerclEm"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZZN7android14ReferenceMover15move_referencesINS_8hardware18BufferedTextOutput11BufferStateEEEvPNS_2spIT_EEPKS7_mEN7RenamerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZZN7android14ReferenceMover15move_referencesINS_8hardware18BufferedTextOutput11BufferStateEEEvPNS_2spIT_EEPKS7_mEN7RenamerD0Ev"
    }
   ]
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTION7android2spINS_8hardware7IBinder14DeathRecipientEEE",
   "name" : "android::sp<android::hardware::IBinder::DeathRecipient> &&",
   "referenced_type" : "_ZTIN7android2spINS_8hardware7IBinder14DeathRecipientEEE",
   "self_type" : "_ZTION7android2spINS_8hardware7IBinder14DeathRecipientEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTION7android2spINS_8hardware7IBinderEEE",
   "name" : "android::sp<android::hardware::IBinder> &&",
   "referenced_type" : "_ZTIN7android2spINS_8hardware7IBinderEEE",
   "self_type" : "_ZTION7android2spINS_8hardware7IBinderEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h"
  }
 ]
}
